[
    {
        "text": "Dune is set in the distant future amidst a feudal interstellar society in which various noble houses control planetary fiefs. It tells the story of young Paul Atreides, whose family accepts the stewardship of the planet Arrakis. While the planet is an inhospitable and sparsely populated desert wasteland, it is the only source of melange, or 'the spice,' a drug that extends life and enhances mental abilities. Melange is also necessary for space navigation, which requires a kind of multidimensional awareness and foresight that only the drug provides.[6] As melange can only be produced on Arrakis, control of the planet is thus a coveted and dangerous undertaking. The story explores the multilayered interactions of politics, religion, ecology, technology, and human emotion, as the factions of the empire confront each other in a struggle for the control of Arrakis and its spice. A very good read.",
        "user_id": 4,
        "book_id": 1
    },
    {
        "text": "The Culture - a humanoid/machine symbiotic society - has thrown up many great Game Players. One of the best is Jernau Morat Gurgeh, Player of Games, master of every board, computer and strategy. Bored with success, Gurgeh travels to the Empire of Azad, cruel & incredibly wealthy, to try their fabulous game, a game so complex, so like life itself, that the winner becomes emperor. Mocked, blackmailed, almost murdered, Gurgeh accepts the game and with it the challenge of his life, and very possibly his death. A great read.",
        "user_id": 4,
        "book_id": 2
    },
    {
        "text": "The man known as Cheradenine Zakalwe was one of Special Circumstances' foremost agents, changing the destiny of planets to suit the Culture through intrigue, dirty tricks and military action. The woman known as Diziet Sma had plucked him from obscurity and pushed him towards his present eminence, but despite all their dealings she did not know him as well as she thought. The drone known as Skaffen-Amtiskaw knew both of these people. It had once saved the woman's life by massacring her attackers in a particularly bloody manner. It believed the man to be a lost cause. But not even its machine could see the horrors in his past. Ferociously intelligent, both witty and horrific, USE OF WEAPONS is a masterpiece of science fiction.",
        "user_id": 4,
        "book_id": 3
    },
    {
        "text": "Here is the first volume in George R. R. Martin’s magnificent cycle of novels that includes A Clash of Kings and A Storm of Swords. As a whole, this series comprises a genuine masterpiece of modern fantasy, bringing together the best the genre has to offer. Magic, mystery, intrigue, romance, and adventure fill these pages and transport us to a world unlike any we have ever experienced. Already hailed as a classic, George R. R. Martin’s stunning series is destined to stand as one of the great achievements of imaginative fiction.",
        "user_id": 4,
        "book_id": 4
    },
    {
        "text": "Very scary",
        "user_id": 1,
        "book_id": 10
    },
    {
        "text": "A must have cookbook for every Australian.",
        "user_id": 4,
        "book_id": 14
    },
    {
        "text": "Just after midnight, a snowdrift stops the Orient Express in its tracks. The luxurious train is surprisingly full for the time of the year, but by the morning it is one passenger fewer. An American tycoon lies dead in his compartment, stabbed a dozen times, his door locked from the inside. Isolated and with a killer in their midst, detective Hercule Poirot must identify the murderer—in case he or she decides to strike again.",
        "user_id": 1,
        "book_id": 12
    },
    {
        "text": "Barack Obama is as fine a writer as they come. It is not merely that this book avoids being ponderous, as might be expected, even forgiven, of a hefty memoir, but that it is nearly always pleasurable to read, sentence by sentence, the prose gorgeous in places, the detail granular and vivid. From Southeast Asia to a forgotten school in South Carolina, he evokes the sense of place with a light but sure hand. This is the first of two volumes, and it starts early in his life, charting his initial political campaigns, and ends with a meeting in Kentucky where he is introduced to the SEAL team involved in the Abbottabad raid that killed Osama bin Laden.",
        "user_id": 2,
        "book_id": 13
    },
    {
        "text": "Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in, oh, at least one language, he retraces his travels as a student twenty years before. Whether braving the homicidal motorist of Paris, being robbed by gypsies in Florence, attempting not to order tripe and eyeballs in a German restaurant, window-shopping in the sex shops of the Reeperbahn or disputing his hotel bill in Copenhagen, Bryson takes in the sights, dissects the culture and illuminates each place and person with his hilariously caustic observations. He even goes to Liechtenstein.",
        "user_id": 3,
        "book_id": 16
    }
]